# VectorAtPoint Properties

---
The VectorAtPoint type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from ValueAtPointBase)
Top
#### Reference
VectorAtPoint Class
Autodesk.Revit.DB.Analysis Namespace